#괄호 안에 있는 것을 출력해줘 print는 전체는 소문자로 쓰는것으로 약속
print('Hello World!')

#괄호 안에 있는 내용이 한글로도 가능(+기호도 숫자도 가능하다)
print('토끼야 안녕!')

#숫자형
#정수, 실수도 가능하다
#숫자를 쓸때는 작은 따옴표를 사용하지 않아도 된다.
print(1)
print(-2)
print(3.14)

#연산자 더하기,빼기,곱하기,나누기 (+, - , *, /)
print(1+2)
print(3-2)
print(2*4)
print(6/3)

# 제곱,몫,나머지 (**, //, %)
print(5**2)
print(5//2)
print(5%2)

#예제
print(3+7)
print(6*3)
print(4**2) #제곱
print(9%5) #나머지

#문자열
#큰따옴표와 작은 따옴표를 이용하여 사용 가능
print('Hello World!')
print('3.14') #숫자열이 아닌 문자열로 인식 숫자는 따옴표 없이 작성
print('토끼야 안녕!')
print("토끼야 안녕!")

#문자열 연산
#사용 가능한 연산자는 +와 *
print('토끼' + '야 안녕!')
print('다람쥐' + '야 안녕!')
# 문자열 + 문자열은 붙이기 문자열 * 정수에 맞게 문자열이 표시(정수만 곱할 수 있다)
print('데굴' * 2)
print('데굴' * 4)
